Layer (type)                    Output Shape         Param #     Connected to            
==========================================================================================
input_1 (InputLayer)            [(None, None, 3)]    0                                   
__________________________________________________________________________________________
data-split (DataSplitLayer)     ((None, None, 3), (N 0           input_1[0][0]           
__________________________________________________________________________________________
x_conv_layer (XConvLayer)       ((None, None, 3), (N 9864        data-split[0][0]        
                                                                 data-split[0][1]        
__________________________________________________________________________________________
x_conv_pooling_layer (XConvPool ((None, None, 3), (N 24276       x_conv_layer[0][0]      
                                                                 x_conv_layer[0][1]      
__________________________________________________________________________________________
x_conv_pooling_layer_1 (XConvPo ((None, None, 3), (N 75592       x_conv_pooling_layer[0][0]
                                                                 x_conv_pooling_layer[0][1]
__________________________________________________________________________________________
x_conv_pooling_layer_2 (XConvPo ((None, None, 3), (N 230704      x_conv_pooling_layer_1[0][0]
                                                                 x_conv_pooling_layer_1[0][1]
__________________________________________________________________________________________
feature_reshape_layer (FeatureR ((None, None, 3), (N 260928      x_conv_pooling_layer_2[0][0]
                                                                 x_conv_pooling_layer_2[0][1]
__________________________________________________________________________________________
output_conditional_segmentation (None, None, 40)     7720        feature_reshape_layer[0][0]
                                                                 feature_reshape_layer[0][1]
=============================================================================================
Trainable params: 601,356
Non-trainable params: 7,728
__________________________________________________________________________________________



__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, None, 3)]    0
__________________________________________________________________________________________________
data-split (DataSplitLayer)     ((None, None, 3), (N 0           input_1[0][0]
__________________________________________________________________________________________________
x_conv_layer (XConvLayer)       ((None, None, 3), (N 9864        data-split[0][0]
                                                                 data-split[0][1]
__________________________________________________________________________________________________
x_conv_pooling_layer (XConvPool ((None, None, 3), (N 24276       x_conv_layer[0][0]
                                                                 x_conv_layer[0][1]
__________________________________________________________________________________________________
x_conv_pooling_layer_1 (XConvPo ((None, None, 3), (N 75592       x_conv_pooling_layer[0][0]
                                                                 x_conv_pooling_layer[0][1]
__________________________________________________________________________________________________
x_conv_pooling_layer_2 (XConvPo ((None, None, 3), (N 230704      x_conv_pooling_layer_1[0][0]
                                                                 x_conv_pooling_layer_1[0][1]
__________________________________________________________________________________________________
feature_reshape_layer (FeatureR ((None, None, 3), (N 260928      x_conv_pooling_layer_2[0][0]
                                                                 x_conv_pooling_layer_2[0][1]
__________________________________________________________________________________________________
output_conditional_segmentation (None, None, 40)     7720        feature_reshape_layer[0][0]
                                                                 feature_reshape_layer[0][1]
==================================================================================================
Total params: 609,084
Trainable params: 601,356
Non-trainable params: 7,728
__________________________________________________________________________________________________
